function tea() {
  darJeelIng = [
    "darJeelIng",
    "다즐링 Darjeeling",
    "카페인이 적어",
    "불면증을 개선하는데 많은 도움을 줍니다.",
    " ",
    " ",
    "스트레스를 풀어주고",
    "과민된 정신을 안정시켜주는 작용이 있어,",
    "편안한 숙면을 유도합니다.",
    " ",
    " ",
    "홍차에 들어있는",
    "플라보노이드란 성분이",
    "혈압 개선에 큰 도움을 준답니다."
  ]
  OoLong = [
    "OoLong",
    "우롱차 Oolong tea",
    "세포의 노화 및 산화를 예방해주어",
    "지질대사를 개선하여 체지방을 분해하여",
    "콜레스테롤 수치를 낮추는 효과가 있어",
    "고지혈증, 고혈압 등",
    "혈관성 질환예방 및 개선에 도움이 된답니다.",
    " ",
    " ",
    "우롱차에 들어있는 카테킨 성분은",
    "에너지대사, 지방 연소를 촉진하는 역할을 하기에",
    "다이어트에도 도움이 되며",
    "지방의 축척을 막아주며 분해하여",
    "몸 밖으로 배출시키는 역할을 한답니다.",
  ]
  earlGrey = [
    "earlGrey",
    "얼그레이 Earl Grey",
    "얼그레이는",
    "노화와 질병을 예방하는",
    "폴리페놀이 풍부하게 함유되어 있기 때문에",
    "성장기의 어린이나 노인들은 물론 나이와는 관계없이",
    "모두에게 좋은 효능과 효과를 나타내고 있습니다.",
    " ",
    " ",
    "얼그레이의 영양 성분들은",
    "항암, 면역력 개선, 노화 방지 등의 효과가 있답니다.",
  ]
  camomile = [
    "camomile",
    "캐모마일 Camomile  ",
    "캐모마일차는",
    "면역력 향상에 도움을 줍니다.",
    " ",
    " ",
    "비타민C가 풍부하여 감기예방에도 좋은 효능을 가지고 있으며,",
    "혈당을 조절에 도움을 주고,",
    "피부진정 효과도 있어",
    "피부 트러블 완화에도 도움을 준답니다.",
    " ",
    " ",
    "캐모마일은 부드러운 향을 가지고 있고",
    "불안증상을 완화하는 효능을 가지고 있어",
    "불면증 효과에도 좋다고 합니다."
  ]
  englishBreakfast = [
    "englishBreakfast",
    "잉글리쉬브랙퍼스트 English Breakfast",
    "브랙퍼스트티란 이름에서도 알 수 있듯이",
    "아침의 상쾌함을 느끼게 해주고 ",
    "정신을 맑게 해준다는 의미가 있습니다.",
    " ",
    " ",
    "다른 홍차들과 마찬가지로 카페인이 들어 있기 때문에",
    "각성효과가 있습니다.",
    " ",
    " ",
    "많이 섭취할 때에 문제가 되는 불면증이나 어지러움이 있지만 ",
    "적당량 먹을 때는 노폐물을 제거해주고",
    "상쾌한 정신을 불러올 수 있답니다."
  ]
  pepperMint = [
    "pepperMint",
    "페퍼민트 Peppermint",
    "상쾌하면서 톡 쏘는 듯한 특유의 향기는",
    "마음을 진정시켜 주는 것은 물론",
    "집중력 향상 효과를 나타냅니다.",
    " ",
    " ",
    "공부하는 학생들이나 많은 업무를 하는 직장인 등",
    "집중력을 필요로 하는 사람들이 페퍼민트를 마시면",
    "집중력 향상에 많은 도움이 됩니다.",
  ]
  hibiscus = [
    "hibiscus",
    "히비스커스 Hibiscus",
    "흔히 ‘다이어트 차’라고도 알려진 히비스커스차는",
    "딸기보다 100배 많은 안토시아닌이라는 성분이",
    "혈관 안에 존재하는 찌꺼기를 제거하고,",
    "하이드록시시트릭산 성분이 신진대사를 조절해",
    "지방을 과도하게 흡수하는 것을 막아준답니다.", 
    " ",
    " ",
    "결과적으로 노폐물 배출이 원활해져 부기가 빠지는 게 됩니다."
  ]
  rooibos = [
    "rooibos",
    "루이보스 Rooibos",
    "루이보스차는 항산화 작용에 탁월한 효능이 있답니다.",
    " ",
    " ",
    "특히 루이보스차에는 강력한 항산화 물질이",
    "녹차의 50배 가량 들어 있다고 합니다.",
    " ",
    " ",
    "이는 초과산화물 불균등화 효소라고 부르며,",
    "체내 활성 산소를 분해하는 역할을 해주어",
    "노화 방지, 성인병 등 각종 질병 예방,",
    "그리고 피부 미용에도 효능이 있답니다."
  ]
  jasmine = [
    "jasmine",
    "쟈스민 jasmine",
    "쟈스민은 아로마테라피에서도 많이 사용될 정도로",
    "스트레스를 해소하고 마음을 진정시키는데 효과가 있답니다.",
    " ",
    " ",
    "은은하고 그윽한 향은 부교감 신경을 활성화 시키고",
    "심박수를 줄여주며", 
    "몸과 마음을 진정시키는 효능이 있다고 합니다."
  ]

  randName = [darJeelIng, OoLong, earlGrey, camomile, englishBreakfast, pepperMint, hibiscus, rooibos, jasmine]
  randomNum = randName[Math.floor(Math.random() * 9)]
  $("#teaTitle").text(randomNum[1]);
  for (i=2; (i<randomNum.length); i++){
    var id_name = document.getElementById("tea" + i)

    if (randomNum[i] == undefined){
      id_name.innerText = " "
    }
    else{
      id_name.innerText = randomNum[i]
    }
    
  }
  var blurTop = document.getElementById("blurTop");
  var blurUnder = document.getElementById("blurUnder");
  blurTop.src = 'images/blur/' + randomNum[0] + '.png'
  blurUnder.src = 'images/blur/' + randomNum[0] + '.png'
}