function poem() {
  poem0 = [
    "하루살이",
    "최태안",
    "인생이 길지 않다며",
    "시간을 쪼개어 아껴 쓰고",
    " ",
    " ",
    "오늘 같은 내일이",
    "다시 온다는 보장이 없어",
    "매 순간 값진 일을 찾아",
    "전력으로 질주하며",
    " ",
    " ",
    "해 질 녘에는 회개로",
    "하루를 마무리하는",
    "겸허하고 겸허한",
    "하루살이"
  ]
  poem1 = [
    "바다는 잘 있습니다",
    "이병률",
    "세상의 모든 식당의 젓가락은",
    "한 식당에 모여서도",
    "원래의 짝을 잃고 쓰여지는 법이어서",
    " ",
    " ",
    "저 식탁에 뭉쳐 있다가",
    "이 식탁에서 흩어지기도 한다",
    " ",
    " ",
    "오랜 시간 지나 닳고 닳아",
    "누구의 짝인지도 잃은 것이 무엇인지 모르고 살다가도",
    "무심코 누군가 통에서 두개를 집어드는 순간",
    "서로 힘줄이 맞닿으면서 안다",
    " ",
    " ",
    "아, 우리가 그 반이로구나"
  ]
  poem2 = [
    "누구나 그렇게 서른이 된다",
    "편채원",
    "세상에 당연한 건 없었다.",
    "",
    "",
    "고된 시간을 견뎌낸 꽃이라 해서",
    "모두가 제때 열매를 맺는 것은 아니었으니까.",
    "",
    "",
    "조금 느리고 서투르면 어때.",
    "우리의 서른은, 아직 피어나는 중인 걸."
  ]
  poem3 = [
    "외눈박이 물고기의 사랑",
    "류시화",
    "슬픔이 그대를 부를 때",
    "고개를 돌리고",
    "쳐다보라",
    "세상의 어떤 것에도 의지할 수 없을 때",
    "그 슬픔에 기대라",
    "저편 언덕처럼",
    " ",
    " ",
    "슬픔이 그대를 손짓할 때",
    "그곳으로 걸어가라",
    "세상의 어떤 의미에도 기댈 수 없을 때",
    "저편 언덕으로 가서",
    "그대 자신에게 기대라",
    "슬픔에 의지하되",
    "다만 슬픔의 소유가 되지 말라"
  ]
  poem4 = [
    "바람이 오면",
    "도종환",
    "바람이 오면",
    "오는 대로 두었다가",
    "가게 하세요",
    " ",
    " ",
    "그리움이 오면",
    "오는 대로 두었다가",
    "가게 하세요",
    " ",
    " ",
    "아픔도 오겠지요",
    "머물러 살겠지요",
    "살다간 가겠지요",
    " ",
    " ",
    "세월도 그렇게",
    "왔다간 갈 거예요",
    "가도록 그냥 두세요"
  ]
  poem5 = [
    "별은 너에게로",
    "박노해",
    "어두운 길을 걷다가",
    "빛나는 별 하나 없다고",
    "절망하지 말아라",
    " ",
    " ",
    "가장 빛나는 별은 아직",
    "도달하지 않았다",
    " ",
    " ",
    "구름 때문이 아니다",
    "불운 때문이 아니다",
    " ",
    " ",
    "지금까지 네가 본 별들은",
    "수억 광년 전에 출발한 빛",
    " ",
    " ",
    "길 없는 어둠을 걷다가",
    "별의 지도마저 없다고",
    "주저앉지 말아라",
    " ",
    " ",
    "가장 빛나는 별은 지금",
    "간절하게 길을 찾는 너에게로",
    "빛의 속도로 달려오고 있으니"
  ]
  poem6 = [
    "하루",
    "정용관",
    "기나긴 하루가 또 갑니다",
    "지치고 무거운 몸을 이끌고",
    "집으로 돌아오는 길",
    "몹쓸 안쓰러움에 서러움이 밀려옵니다",
    " ",
    " ",
    "힘들게 버틴 하루였습니다",
    "무엇 때문에 이 길을 가고 있는지",
    "알 수 없는 두려움에",
    "하루에도 열두 번씩 몸서리가 쳐집니다",
    " ",
    " ",
    "어둠이 내리기 시작한 늦은 저녁",
    "멍한 눈으로 먼 산을 바라봅니다",
    "시간을 속인 해님 달님이",
    "서로 마주 보고 쓸쓸히 웃고 있습니다"
  ]
  poem7 = [
    "나를 키우는 말",
    "이해인",
    "행복하다고 말하는 동안은",
    "나도 정말 행복해서",
    "마음에 맑은 샘이 흐르고",
    " ",
    " ",
    "고맙다고 말하는 동안은",
    "고마운 마음 새로이 솟아올라",
    "내 마음도 더욱 순해지고",
    " ",
    " ",
    "아름답다고 말하는 동안은",
    "나도 잠시 아름다운 사람이 되어",
    "마음 한 자락이 환해지고",
    "좋은 말이 나를 키우는 걸",
    "나는 말하면서 다시 알지"
  ]
  poem8 = [
    "그날",
    "곽효환",
    "그날 텔레비전 앞에서 늦은 저녁을 먹다가",
    "울컥 울음이 터졌다",
    "멈출 수 없어 그냥 두었다",
    "오랫동안 오늘 이전과 이후만 있을 것 같아",
    "밤새 잠을 이루지 못했다",
    " ",
    " ",
    "그 밤, 다시 견디는 힘을 배우기로 했다"
  ]
  poem9 = [
    "그대 지친 하루 기대고 싶은 날엔",
    "김춘경",
    "사랑하는 사람아",
    "그대 지친 하루 기대고 싶은 날엔",
    "저녁놀 아름다운 강가에 서서",
    "묵묵히 빛 밝혀 세상을 지켜 낸",
    "태양보다 값진 어제를 바라다보자",
    " ",
    " ",
    "그대 지나온 시간 보석처럼 빛나",
    "강물 위에 소리 없이 흐르고",
    "지는 하늘 가득 고운 피땀으로",
    "붉은 석양 수놓을 때",
    "무거운 어깨 새 등을 타고 날아가리",
    " ",
    " ",
    "오늘을 사는 이유 서러워",
    "쏟아진 눈물 강둑을 메워도",
    "불어나지 않고 흐르는 강물",
    "바람도 잠든 이 저녁에",
    "그대, 밝은 내일 또 꿈꾸어 보자",
    " ",
    " ",
    "함께 저물어도 슬프지 않을",
    "아름다운 사람아..."
  ]

  randName = [poem0, poem1, poem2, poem3, poem4, poem5, poem6, poem7, poem8, poem9]
  randomNum = randName[Math.floor(Math.random() * 9)]
  $("#poemTitle").text(randomNum[0]);
  $("#writer").text(randomNum[1]);
  for (i=2; (i<poem1.length); i++){
    var id_name = document.getElementById("content" + i)
    id_name.innerText = randomNum[i]
  }


}

// $(window).scroll(function(){
//   $("#poemTitle").text(poem1[0]);
// });

// $(window).scroll(function(){
//   $("#writer").text(poem1[1]);
// });

// $(window).scroll(function(){
//   for (i=2; (i<poem1.length-2); i++){
//     id_name = "content" + i
//     console.log(id_name)
//     content_name = poem1[i]
//     $("#id_name").text(content_name);
//   }
  
// });

// for (i=2; (i<poem1.length-2); i++){
//   var id_name = document.getElementById(i)
//   id_name.innerText = poem1[i]
// }
// $("#poemTitle").text(poem1[0]);
// $("#writer").text(poem1[1]);
// }